"""
    Написать функцию, которая будет проверять счастливый билетик или нет.
    Билет счастливый, если сумма одной половины цифр равняется сумме второй.
"""


def is_lucky(ticket_num):
    s = str(ticket_num)
    x = list(s)
    print(x)
    sum1 = int(s[0]) + int(s[1]) + int(s[2])
    sum2 = int(s[3]) + int(s[4]) + int(s[5])
    if sum1 == sum2:
        print('Счастливый')
    else:
        print('Обычный')


assert is_lucky(1230) is True
assert is_lucky(239017) is False
assert is_lucky(134008) is True
assert is_lucky(15) is False
assert is_lucky(2020) is True
assert is_lucky(199999) is False
assert is_lucky(77) is True
assert is_lucky(479974) is True

print("All tests passed successfully!")
